/*First level: Задача заключается в следующем. Имеется три стержня — левый, средний и правый. На левом стержне находятся n дисков, диаметры которых различны. Диски упорядочены по размеру диаметра, сверху лежит наименьший, снизу — наибольший. Требуется перенести диски с левого стержня на правый, используя средний стержень как вспомогательный.


Головоломка имеет следующие два правила:
1. Вы не можете поместить больший диск на меньший диск.
2. За один раз можно перемещать только один диск.


Попробуйте реализовать итеративный метод решения (без рекурсии)*/

// time complexity O(n)
// space complexity O(1)

function move(sterg1, sterg2, sterg3, rings) {
	if (rings % 2 == 0) {
		const int = rod_2;
		sterg2 = sterg3;
		sterg3 = int;
	}

    Далее будет цикл for и кучв условий if
	for  
		if (i % 3 == 1) 
		
		if (i % 3 == 2) 
			
		if (i % 3 == 0) {
			
}

const a = [4, 3, 2, 1];
// const a = [3, 2, 1];
// const a = [2, 1];
let b = [];
let c = [];

Что делать дальше и как решить не знаю!!!!мы пока ни на столько хорошие специалисты и знатоки джава скрипт.Джава скрипт у нас с нуля и мы учим ее чуть больше месяца.Поэтому как всё прописать правильно я пока не знаю

